{
    "status":"OK",
    "request_id":"d5ecc61d-546d-43a9-baf4-d8c842093360",
    "parameters":{"query":"product manager","page":1,"num_pages":1},
    "data": [
        {"employer_name":"Toast","employer_logo":"https://res.cloudinary.com/crunchbase-production/image/upload/c_lpad,h_256,w_256,f_auto,q_auto:eco,dpr_1/qakub6in9irfgc3yksde","employer_website":"http://www.toasttab.com","employer_company_type":"Information","job_publisher":"Toast Careers","job_id":"uSXgjO4HaQkAAAAAAAAAAA==","job_employment_type":"FULLTIME","job_title":"Senior Product Manager","job_apply_link":"https://careers.toasttab.com/jobs/senior-product-manager-remote-united-states","job_apply_is_direct":false,"job_apply_quality_score":0.8858,"job_description":"Toast is driven by building the restaurant platform that helps restaurants adapt, take control, and get back to what they do best: building the businesses they love.\n\nSenior Product Manager, Toast Web\n\nAre you bready* for a change?\n\nNow, more than ever, the Toast team is committed to our customers. We’re taking steps to help restaurants navigate these unprecedented times with technology, resources, and community. Our focus is on building the restaurant platform that helps restaurants adapt, take control, and get back to what they do best: building the businesses they love. And because our technology is purpose-built for restaurants, by restaurant people, restaurants can trust that we’ll deliver on their needs for today while investing in experiences that will power their restaurant of the future.\n\nAbout the Role:\n\nWe are looking for an amazing product manager to own and drive the evolution of the authenticated Toast experience - Toast Web. Toast Web is our core software that all our web applications live in. As a Product manager of the Toast Web, you’ll collaborate with cross-functional partners across all business lines, and work closely with your researchers, designers and engineers to create a next-generation Toast Online experience that is simple, clear, and delightful. We’re a passionate team driving the consistency and integrity of the current, and strategy and vision of the next generation product experience at Toast. We operate both as a well established platform team, and as a startup with high ambitions and a focus on experimentation, testing, and iteration.\n\nAbout You:\n\nYou are obsessed about understanding customers and their needs, and measuring impact of products you release. You love solving complex problems and scaling simplicity for customers. You are grounded in data, customer feedback, cross-functional partnerships, and an ability to translate customer needs and product vision into world-class experiences.\n\nYou have a proven track record of building and shipping amazing search enabled web-application experiences for business users and consumers. You understand the power of extensibility and reusability mobile, as a form factor, and the ways in which it will help scale transform existing use cases and customer needs across multiple form factors.\n\nAbout this roll*:\n• Own and drive the vision and strategy roadmap for the next generation of Toast Web, reimagining how restaurant managers interact with Toast, as well as how our internal teams code the front-end of applications living within it.\n• Work closely with designers and developers to concept, prototype, ship, measure, and improve product features\n• Translate product strategy into detailed product requirements\n• Research and get to know customers directly through close collaboration with sales and customer\n\nsuccess, customer care including joining sales and customer care calls\n• Champion customer needs internally by building strong relationships horizontally and vertically\n\nwithin Toast\n\nDo you have the right ingredients*?\n• Has experience as a product manager for a business and consumer web application products\n• Obsessed about productivity and efficacy metrics to help customers get their job done in an\n\nintuitive and frictionless manner\n• A proven track record of working collaboratively and effectively with cross-functional teams, and\n\npartnering across business lines\n• Passion for and knowledge of restaurant tech, productivity tech or business communication tech\n• Entrepreneurial mindset and ability to create a compelling vision from ambiguity and achieve\n\nproduct market fit\n• Take ownership of leading a product from concept to market while ensuring the product supports\n\nthe company strategy and meets defined business objectives\n\nWe are Toasters\n\nDiversity, Equity, and Inclusion is Baked into our Recipe for Success.\nAt Toast our employees are our secret ingredient. When they are powered to succeed, Toast succeeds.\nThe restaurant industry is one of the most diverse industries. We embrace and are excited by this diversity, believing that only through authenticity, inclusivity, high standards of respect and trust, and leading with humility will we be able to achieve our goals. Baking inclusive principles into our company and diversity into our design provides equitable opportunities for all and enhances our ability to be first in class in all aspects of our industry.\n\nOur Spread of Total Rewards\n• Unlimited Vacation\n• Sabbatical opportunity after five years\n• Professional Development Reimbursement Program\n• Commitment to Employee Wellness through resources such as a quarterly Wellness Stipend\n• Various peer and company recognition programs\n• 401(k) and matching\n• Medical, Dental, & Vision Coverage\n• Mental Health Benefits\n• Subsidized backup childcare\n• Bread puns encouraged but not required\n\n#LI - Remote US\n\nThe base salary range for this role is listed below. The starting salary will be determined based on skills and experience. In addition to base salary, our total rewards components include cash compensation (overtime, bonus/commissions if eligible), equity, and benefits.\nPay Range\n$124,000—$198,000 USD\n\nWe are Toasters\n\nDiversity, Equity, and Inclusion is Baked into our Recipe for Success.\n\nAt Toast our employees are our secret ingredient. When they are powered to succeed, Toast succeeds.\n\nThe restaurant industry is one of the most diverse industries. We embrace and are excited by this diversity, believing that only through authenticity, inclusivity, high standards of respect and trust, and leading with humility will we be able to achieve our goals.\n\nBaking inclusive principles into our company and diversity into our design provides equitable opportunities for all and enhances our ability to be first in class in all aspects of our industry.\n\nBready* to make a change? Apply today!\n\nToast is committed to creating an accessible and inclusive hiring process. As part of this commitment, we strive to provide reasonable accommodations for persons with disabilities to enable them to access the hiring process. If you need an accommodation to access the job application or interview process, please contact candidateaccommodations@toasttab.com.","job_is_remote":false,"job_posted_at_timestamp":1682001697,"job_posted_at_datetime_utc":"2023-04-20T14:41:37.000Z","job_city":null,"job_state":null,"job_country":"US","job_latitude":37.09024,"job_longitude":-95.71289,"job_benefits":["retirement_savings","health_insurance","dental_coverage"],"job_google_link":"https://www.google.com/search?gl=us&hl=en&rciv=jb&q=product+manager&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=product+manager&htidocid=uSXgjO4HaQkAAAAAAAAAAA%3D%3D","job_offer_expiration_datetime_utc":"2023-07-20T13:27:59.000Z","job_offer_expiration_timestamp":1689859679,"job_required_experience":{"no_experience_required":false,"required_experience_in_months":null,"experience_mentioned":true,"experience_preferred":false},"job_required_skills":null,"job_required_education":{"postgraduate_degree":false,"professional_certification":false,"high_school":false,"associates_degree":false,"bachelors_degree":false,"degree_mentioned":false,"degree_preferred":false,"professional_certification_mentioned":false},"job_experience_in_place_of_education":false,"job_min_salary":null,"job_max_salary":null,"job_salary_currency":null,"job_salary_period":null,"job_highlights":{"Qualifications":["You are obsessed about understanding customers and their needs, and measuring impact of products you release","You love solving complex problems and scaling simplicity for customers","You are grounded in data, customer feedback, cross-functional partnerships, and an ability to translate customer needs and product vision into world-class experiences","You have a proven track record of building and shipping amazing search enabled web-application experiences for business users and consumers","You understand the power of extensibility and reusability mobile, as a form factor, and the ways in which it will help scale transform existing use cases and customer needs across multiple form factors","Has experience as a product manager for a business and consumer web application products","Obsessed about productivity and efficacy metrics to help customers get their job done in an","intuitive and frictionless manner","Passion for and knowledge of restaurant tech, productivity tech or business communication tech","Entrepreneurial mindset and ability to create a compelling vision from ambiguity and achieve","product market fit"],"Responsibilities":["Own and drive the vision and strategy roadmap for the next generation of Toast Web, reimagining how restaurant managers interact with Toast, as well as how our internal teams code the front-end of applications living within it","Work closely with designers and developers to concept, prototype, ship, measure, and improve product features","Translate product strategy into detailed product requirements","Research and get to know customers directly through close collaboration with sales and customer","success, customer care including joining sales and customer care calls","Champion customer needs internally by building strong relationships horizontally and vertically","Take ownership of leading a product from concept to market while ensuring the product supports"],"Benefits":["Our Spread of Total Rewards","Unlimited Vacation","Sabbatical opportunity after five years","Professional Development Reimbursement Program","Commitment to Employee Wellness through resources such as a quarterly Wellness Stipend","Various peer and company recognition programs","401(k) and matching","Medical, Dental, & Vision Coverage","Mental Health Benefits","Subsidized backup childcare","Bread puns encouraged but not required","The base salary range for this role is listed below","The starting salary will be determined based on skills and experience","In addition to base salary, our total rewards components include cash compensation (overtime, bonus/commissions if eligible), equity, and benefits","Pay Range","$124,000—$198,000 USD"]},"job_job_title":"Product manager","job_posting_language":"en","job_onet_soc":"11202100","job_onet_job_zone":"4"},{"employer_name":"Motive","employer_logo":"https://www.trucknews.com/wp-content/uploads/2022/04/motive-logo-1.jpg","employer_website":"https://gomotive.com","employer_company_type":null,"job_publisher":"LinkedIn","job_id":"GI1E7aliZjoAAAAAAAAAAA==","job_employment_type":"FULLTIME","job_title":"Staff Product Manager, Risk (Motive Card)","job_apply_link":"https://www.linkedin.com/jobs/view/staff-product-manager-risk-motive-card-at-motive-3576703677","job_apply_is_direct":false,"job_apply_quality_score":0.5644,"job_description":"Who We Are\n\nMotive builds technology to improve the safety, productivity, and profitability of businesses that power the physical economy. Motive combines IoT hardware with AI-powered applications to connect and automate physical operations. Motive is one of the fastest-growing software companies in the world, serving more than 120,000 businesses, across a wide range of industries including trucking and logistics, construction, oil and gas, food and beverage, field service, agriculture, passenger transit, and delivery.\n\nMotive is built on four foundational attributes; Own It, Less but Better, Build Trust, and Unlock Potential. This has taken our company to great heights, including being recognized by Fortune for Best Workplaces, Forbes Best Startup Employers, and Comparably for our Best Global Culture, Sales Team, Leadership Team, Career Growth, and CEO for Diversity. We’re proud to receive an employee net promoter score of 63 (according to Comparably) which places Motive in the top 5% of companies with 4,000 employees or more.\n\nToday, our team is made up of more than 3,000 employees, located across the world, providing support to a wide range of customers. While most of our employees are remote, many have the opportunity to work on-site at any of our 8 global office locations. Visit our careers website to learn more about opportunities at Motive.\n\nAbout The Role\n\nThe risk team at Motive builds the foundation for managing our risk across all our financial products including Motive Card. In this role you will lead and own the strategy and roadmap of the risk team. The ideal candidate will have a mix of customer focus and appreciation for financial risk, thrive in a fast-moving environment, and be an expert in negotiating and prioritizing business needs to drive customer impact.\n\nAs Staff Product Manager, Risk, you will partner closely with other product managers, designers, engineers, risk operations and other stakeholders to build and manage risk systems at Motive. And you’ll need to quickly develop expert knowledge of our customers, our offerings, and the market. In return, you’ll receive visibility across the organization and will be a key voice in one of the most exciting companies in the transportation industry. This is a great time to join Motive, and we’re looking for heavy-hitters to join us on our mission.\n\nWhat You’ll Do\n• Set out the vision and roadmap for Risk at Motive.\n• Drive group alignment around product features to efficiently execute the risk roadmap.\n• Develop and articulate metrics, requirements, goals, and features to all relevant stakeholders.\n• Develop product documentation including product requirement documentation, wireframes and process flows.\n• Partner with business leaders from stakeholder teams on formulation and execution of the digital strategy, vision and product roadmap.\n\nWhat We’re Looking For\n• 5+ years experience with Product Management\n• Domain expertise in payments and risk is a strong plus.\n• High customer empathy, with a desire to get in the shoes of our customers\n• Have high “EQ”; be even-keeled, flexible, and able to quickly adapt to unexpected changes\n• Proven experience in delivering commercially successful software products\n• Be data-driven; you regularly seek out and use hard data and metrics to back up assumptions and opinions\n• Excellent interpersonal skills with the ability to work well with different personality types and seniority levels\n• Have enough technical knowledge to enough to gain the respect of software engineers\n• Experience working effectively with remote/offshore teams\n• Experience in agile product development.\n• Knowledgeable in data structures, SQL, and developing reporting.\n\nPay Transparency\n\nYour compensation may be based on several factors, including education, work experience, and certifications. For certain roles, total compensation may include restricted stock units. Motive offers benefits including health, pharmacy, optical and dental care benefits, paid time off, sick time off, short term and long term disability coverage, life insurance as well as 401k contribution (all benefits are subject to eligibility requirements). Learn more about our benefits by visiting Motive Perks & Benefits.\n\nFor This Role, The Compensation Ranges Are\n\nThe compensation range for this position will depend on where you reside. Motive uses three geographic zones to determine pay range.\n\nSan Francisco, California\n\n$182,000—$250,000 USD\n\nU.S. metropolitan areas: Los Angeles, San Diego, New York City Area, Seattle, Washington D.C.\n\n$164,000—$225,000 USD\n\nOther locations in the United States\n\n$146,000—$200,000 USD\n\nCreating a diverse and inclusive workplace is one of Motive's core values. We are an equal opportunity employer and welcome people of different backgrounds, experiences, abilities and perspectives.\n\nPlease review our Candidate Privacy Notice here.\n\nThe applicant must be authorized to receive and access those commodities and technologies controlled under U.S. Export Administration Regulations. It is Motive's policy to require that employees be authorized to receive access to Motive products and technology.","job_is_remote":true,"job_posted_at_timestamp":1681948706,"job_posted_at_datetime_utc":"2023-04-19T23:58:26.000Z","job_city":null,"job_state":null,"job_country":"US","job_latitude":37.09024,"job_longitude":-95.71289,"job_benefits":["dental_coverage","health_insurance","retirement_savings","paid_time_off"],"job_google_link":"https://www.google.com/search?gl=us&hl=en&rciv=jb&q=product+manager&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=product+manager&htidocid=GI1E7aliZjoAAAAAAAAAAA%3D%3D","job_offer_expiration_datetime_utc":"2023-05-19T23:58:26.000Z","job_offer_expiration_timestamp":1684540706,"job_required_experience":{"no_experience_required":false,"required_experience_in_months":60,"experience_mentioned":true,"experience_preferred":false},"job_required_skills":null,"job_required_education":{"postgraduate_degree":false,"professional_certification":false,"high_school":false,"associates_degree":false,"bachelors_degree":true,"degree_mentioned":false,"degree_preferred":false,"professional_certification_mentioned":true},"job_experience_in_place_of_education":false,"job_min_salary":null,"job_max_salary":null,"job_salary_currency":null,"job_salary_period":null,"job_highlights":{"Qualifications":["5+ years experience with Product Management","Domain expertise in payments and risk is a strong plus","High customer empathy, with a desire to get in the shoes of our customers","Have high “EQ”; be even-keeled, flexible, and able to quickly adapt to unexpected changes","Proven experience in delivering commercially successful software products","Be data-driven; you regularly seek out and use hard data and metrics to back up assumptions and opinions","Excellent interpersonal skills with the ability to work well with different personality types and seniority levels","Have enough technical knowledge to enough to gain the respect of software engineers","Experience working effectively with remote/offshore teams","Experience in agile product development","Knowledgeable in data structures, SQL, and developing reporting","It is Motive's policy to require that employees be authorized to receive access to Motive products and technology"],"Responsibilities":["In this role you will lead and own the strategy and roadmap of the risk team","As Staff Product Manager, Risk, you will partner closely with other product managers, designers, engineers, risk operations and other stakeholders to build and manage risk systems at Motive","And you’ll need to quickly develop expert knowledge of our customers, our offerings, and the market","Set out the vision and roadmap for Risk at Motive","Drive group alignment around product features to efficiently execute the risk roadmap","Develop and articulate metrics, requirements, goals, and features to all relevant stakeholders","Develop product documentation including product requirement documentation, wireframes and process flows","Partner with business leaders from stakeholder teams on formulation and execution of the digital strategy, vision and product roadmap"],"Benefits":["Your compensation may be based on several factors, including education, work experience, and certifications","For certain roles, total compensation may include restricted stock units","Motive offers benefits including health, pharmacy, optical and dental care benefits, paid time off, sick time off, short term and long term disability coverage, life insurance as well as 401k contribution (all benefits are subject to eligibility requirements)","For This Role, The Compensation Ranges Are"]},"job_job_title":"Product manager","job_posting_language":"en","job_onet_soc":"11202100","job_onet_job_zone":"4"},{"employer_name":"Walmart","employer_logo":"https://cdn.corporate.walmart.com/dims4/WMT/71169a3/2147483647/strip/true/crop/2389x930+0+0/resize/980x381!/quality/90/?url=https%3A%2F%2Fcdn.corporate.walmart.com%2Fd6%2Fe7%2F48e91bac4a8ca8f22985b3682370%2Fwalmart-logos-lockupwtag-horiz-blu-rgb.png","employer_website":"https://www.walmart.com","employer_company_type":"Retail","job_publisher":"Walmart Careers","job_id":"BXnegOk1UXwAAAAAAAAAAA==","job_employment_type":"FULLTIME","job_title":"Senior Product Manager (Tech) - Windows Engineering","job_apply_link":"https://careers.walmart.com/us/jobs/WD1442440-senior-product-manager-tech-windows-engineering","job_apply_is_direct":false,"job_apply_quality_score":0.7968,"job_description":"Position Summary...\n\nWhat you'll do...\n\nOur organization, Enterprise Client Experience (ECE) focuses on empowering digital dexterity, ensuring system health, and delivering industry-leading technology through the modern endpoint experience. The Windows Engineering department within ECE is seeking an experienced and dedicated Technical Product Owner to join our growing team. The ideal candidate should have strong expertise in Windows endpoints and endpoint management solutions (Microsoft Windows 11 and Intune), a proven track record in product development, strong communication skills, and the ability to lead cross-functional teams. If you are passionate about creating innovative and user-centric products, we'd love to hear from you.\n\nAbout the Team:\nThe Enterprise People Technology team supports the successful deployment and adoption of new People technology across the enterprise. As a Fortune #1 company, our work impacts millions of associates globally. We strive to continuously improve people technology and products to help managers and associates so they can focus on what matters most - supporting our customers and members. People Technology is one of the major segments of Walmart Global Tech’s Enterprise Business Services, which is invested in building a compact, robust organization that includes service operations and technology solutions for Finance, People, and the Associate Digital Experience.\n\nWhat you'll do:\n• Develop, manage, and execute the product roadmap for our Microsoft Windows 11 and Intune solutions as well as evaluation and selection of endpoint hardware and peripherals ensuring alignment with overall business objectives and optimal associate digital experience. Scope also include product ownership for our enterprise browsers, Microsoft Edge and Google Chrome.\n• Gather and analyze customer requirements, industry trends, product roadmaps, and competitor offerings to identify opportunities for new features and enhancements.\n• Maximizes the value of the product and is the voice of the customer. Manages the product backlog and prioritization based on the strategy and customer needs. Leads the effort to define and prioritize high level user stories for our products and services including acceptance criteria and definition of done, through a partnership with our Technical Experts and Engineer(s).\n• Collaborate closely with engineering, design, and marketing teams to deliver high-quality products on time and within budget.\n• Utilize Agile methodologies to manage project timelines, priorities, and resources effectively.\n• Monitor product performance metrics and KPIs, using data-driven insights to drive continuous improvement and growth.\n• Serve as the primary liaison between stakeholders and the engineering team, communicating product vision, roadmap, and progress updates.\n• Conduct product training sessions for customer and support teams, increasing their understanding of product offerings and benefits.\n• Ensure seamless integration and management of Windows 11 endpoints via Microsoft Intune endpoint management solutions within the organization's IT environment.\n\nWhat you'll bring:\n• Bachelor's degree in computer science, MIS/CIS, Engineering, or a related field.\n• Minimum of 5 years of experience in product management, preferably with a focus on Microsoft Windows and Intune-based solutions.\n• Strong knowledge of Windows 11, Intune, Edge, Chrome, and PC hardware and peripherals, as well as other relevant technologies such as Azure, Active Directory, PowerShell, Graph API, and Microsoft 365's Power Platform.\n• Familiarity with product management methodologies, including Agile, Scrum, Lean, and Kanban.\n• Proven track record of successfully managing and delivering complex products from inception to market.\n• Excellent communication, presentation, and interpersonal skills.\n• Ability to work effectively with cross-functional teams and manage multiple priorities simultaneously.\n• Knowledge of Project Management framework and working experience.\n\nAbout Walmart Global Tech\nImagine working in an environment where one line of code can make life easier for hundreds of millions of people. That’s what we do at Walmart Global Tech. We’re a team of software engineers, data scientists, cybersecurity expert's and service professionals within the world’s leading retailer who make an epic impact and are at the forefront of the next retail disruption. People are why we innovate, and people power our innovations. We are people-led and tech-empowered. We train our team in the skillsets of the future and bring in experts like you to help us grow. We have roles for those chasing their first opportunity as well as those looking for the opportunity that will define their career. Here, you can kickstart a great career in tech, gain new skills and experience for virtually every industry, or leverage your expertise to innovate at scale, impact millions and reimagine the future of retail.\n\nFlexible, hybrid work:\nWe use a hybrid way of working that is primarily in office coupled with virtual when not onsite. Our campuses serve as a hub to enhance collaboration, bring us together for purpose and deliver on business needs. This approach helps us make quicker decisions, remove location barriers across our global team and be more flexible in our personal lives.\n\nBenefits:\nBenefits: Beyond our great compensation package, you can receive incentive awards for your performance. Other great perks include 401(k) match, stock purchase plan, paid maternity and parental leave, PTO, multiple health plans, and much more.\n\nEqual Opportunity Employer:\nWalmart, Inc. is an Equal Opportunity Employer – By Choice. We believe we are best equipped to help our associates, customers and the communities we serve live better when we really know them. That means understanding, respecting and valuing diversity- unique styles, experiences, identities, ideas and opinions – while being inclusive of all people.\n\nThe above information has been designed to indicate the general nature and level of work performed in the role. It is not designed to contain or be interpreted as a comprehensive inventory of all responsibilities and qualifications required of employees assigned to this job. The full Job Description can be made available as part of the hiring process.\n\nMinimum Qualifications...\n\nOutlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications.\n\nOption 1: Bachelor’s degree in computer science, engineering, or related area and 7 years’ experience in product management. Option 2: 9 years’ experience in product management or related area.\n\nPreferred Qualifications...\n\nOutlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications.\n\nMaster’s degree in Computer Science, Engineering, Business Administration, or related area and 6 years’ experience as a product manager, ideally working on consumer-facing, large-scale, highly complex B2B/C products\n\nPrimary Location...\n805 SE Moberly Ln, Bentonville, AR 72716, United States of America","job_is_remote":false,"job_posted_at_timestamp":1681948800,"job_posted_at_datetime_utc":"2023-04-20T00:00:00.000Z","job_city":"Bentonville","job_state":"AR","job_country":"US","job_latitude":36.372356,"job_longitude":-94.21021,"job_benefits":["retirement_savings","health_insurance","paid_time_off"],"job_google_link":"https://www.google.com/search?gl=us&hl=en&rciv=jb&q=product+manager&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=product+manager&htidocid=BXnegOk1UXwAAAAAAAAAAA%3D%3D","job_offer_expiration_datetime_utc":null,"job_offer_expiration_timestamp":null,"job_required_experience":{"no_experience_required":false,"required_experience_in_months":108,"experience_mentioned":true,"experience_preferred":false},"job_required_skills":null,"job_required_education":{"postgraduate_degree":false,"professional_certification":false,"high_school":false,"associates_degree":false,"bachelors_degree":false,"degree_mentioned":true,"degree_preferred":true,"professional_certification_mentioned":false},"job_experience_in_place_of_education":false,"job_min_salary":null,"job_max_salary":null,"job_salary_currency":null,"job_salary_period":null,"job_highlights":{"Qualifications":["The ideal candidate should have strong expertise in Windows endpoints and endpoint management solutions (Microsoft Windows 11 and Intune), a proven track record in product development, strong communication skills, and the ability to lead cross-functional teams","Bachelor's degree in computer science, MIS/CIS, Engineering, or a related field","Minimum of 5 years of experience in product management, preferably with a focus on Microsoft Windows and Intune-based solutions","Strong knowledge of Windows 11, Intune, Edge, Chrome, and PC hardware and peripherals, as well as other relevant technologies such as Azure, Active Directory, PowerShell, Graph API, and Microsoft 365's Power Platform","Familiarity with product management methodologies, including Agile, Scrum, Lean, and Kanban","Proven track record of successfully managing and delivering complex products from inception to market","Excellent communication, presentation, and interpersonal skills","Ability to work effectively with cross-functional teams and manage multiple priorities simultaneously","Knowledge of Project Management framework and working experience","Option 1: Bachelor’s degree in computer science, engineering, or related area and 7 years’ experience in product management","Option 2: 9 years’ experience in product management or related area","Master’s degree in Computer Science, Engineering, Business Administration, or related area and 6 years’ experience as a product manager, ideally working on consumer-facing, large-scale, highly complex B2B/C products"],"Responsibilities":["Develop, manage, and execute the product roadmap for our Microsoft Windows 11 and Intune solutions as well as evaluation and selection of endpoint hardware and peripherals ensuring alignment with overall business objectives and optimal associate digital experience","Gather and analyze customer requirements, industry trends, product roadmaps, and competitor offerings to identify opportunities for new features and enhancements","Maximizes the value of the product and is the voice of the customer","Manages the product backlog and prioritization based on the strategy and customer needs","Leads the effort to define and prioritize high level user stories for our products and services including acceptance criteria and definition of done, through a partnership with our Technical Experts and Engineer(s)","Collaborate closely with engineering, design, and marketing teams to deliver high-quality products on time and within budget","Utilize Agile methodologies to manage project timelines, priorities, and resources effectively","Monitor product performance metrics and KPIs, using data-driven insights to drive continuous improvement and growth","Serve as the primary liaison between stakeholders and the engineering team, communicating product vision, roadmap, and progress updates","Conduct product training sessions for customer and support teams, increasing their understanding of product offerings and benefits","Ensure seamless integration and management of Windows 11 endpoints via Microsoft Intune endpoint management solutions within the organization's IT environment"],"Benefits":["Benefits: Beyond our great compensation package, you can receive incentive awards for your performance","Other great perks include 401(k) match, stock purchase plan, paid maternity and parental leave, PTO, multiple health plans, and much more"]},"job_job_title":"Product manager","job_posting_language":"en","job_onet_soc":"11202100","job_onet_job_zone":"4"},{"employer_name":"Curriculum Associates","employer_logo":null,"employer_website":"http://www.curriculumassociates.com","employer_company_type":null,"job_publisher":"Jobvite","job_id":"xaxr6amMZroAAAAAAAAAAA==","job_employment_type":"FULLTIME","job_title":"Product Manager","job_apply_link":"https://jobs.jobvite.com/curriculumassociates/job/oIA1mfwp","job_apply_is_direct":false,"job_apply_quality_score":0.7459,"job_description":"The successful Product Manager will be a key member of the platform product management team and will work closely with the technology, design, editorial teams to evaluate and deliver content management solutions; developing a deep understanding of internal user needs, communicating product definition and prioritization, analyzing technology solutions, process improvements, working closely with engineering teams to deliver features, and acting upon user feedback to continuously improve the product. The product manager—who is a creative, collaborative problem solver—will thrive in our fast-growing and dedicated environment.\n\nThe impact you’ll have:\n• Drive product design end-to-end, working with the product management, design, and development teams, as well as subject matter experts. This will include researching internal user needs, gathering requirements, scoping, and designing creative solutions, articulating, and prioritizing detailed feature definitions and analyzing commercial solutions as necessary.\n• Craft our integration strategy & vision, engaging with other functional teams to understand and redefine workflows\n• Collaborate with fellow product managers to ensure a cohesive product vision and roadmap\n• Effectively present product plans, ideas, and designs to technical and non-technical stakeholders for feedback\n• Collaborate with UX team to define new user interfaces and process flows\n• Own prioritization of the product backlog, including translation of roadmap features into features, epics/user stories, preparing for the release or program increment (PI) planning\n• Work with assigned engineering scrum teams to plan workflow, define user stories and acceptance criteria, and review test plans\n• Monitor product usage and interact regularly with support teams and educators to analyze product feedback and build product knowledge\n• Stay abreast of trends, key issues, competitors, and partner offerings\n\nWhat we’re looking for:\n• Minimum of 2 years’ experience with content management or digital asset management solutions\n• Experience with content creation workflows\n• Knowledge of the tools and processes development teams use to develop, build, and test integrations.\n• Minimum of 2 years product management experience or product owner in an agile development environment; strong preference for experience with clients in a SaaS environment\n• Proven ability to develop product ideas based on multiple quantitative and qualitative inputs and make decisions that solve user needs after consuming and analyzing the input from various sources\n• Excellent analytical skills with demonstrated experience turning data into actionable insights\n• Demonstrated ability to effectively collaborate across stakeholders both technical and non-technical\n• Terrific organizational, problem-solving and time management skills\n• Ability to thrive in a dynamic, fast-paced software development environment\n• Excellent verbal and written communication skills\n• Knowledge of EdTech industry is a plus\n\nBenefits and Pay Range:\n\nPay Range – This role’s range is $60,750 - $99,750. The wage range for this role takes into account the wide range of factors that Curriculum Associates considers in making compensation decisions based on our Compensation Philosophy. Actual base pay within that range will vary based upon several factors including, but not limited to, prior experience and relevant skill sets. At Curriculum Associates, it is not typical for an individual to be hired at or near the top of the range for their role and compensation decisions are dependent on the facts and circumstances for each case. This role is also eligible to participate in the company bonus plan. The Company recognizes that minimum wage varies by location and will ensure all compensation decisions comply with applicable state and local laws.\n\nBenefits – Benefit eligible employees (and their families) are covered by medical, dental, vision, and basic life insurance. Employees can enroll in our company’s 401k plan and receive an employer match. Employees have access to a flexible vacation and sick policy in addition to twelve paid holidays and a winter office closure between Christmas and New Year's, as well as a number of additional perks and benefits.","job_is_remote":false,"job_posted_at_timestamp":1681689600,"job_posted_at_datetime_utc":"2023-04-17T00:00:00.000Z","job_city":null,"job_state":null,"job_country":"US","job_latitude":37.09024,"job_longitude":-95.71289,"job_benefits":["paid_time_off","retirement_savings","health_insurance","dental_coverage"],"job_google_link":"https://www.google.com/search?gl=us&hl=en&rciv=jb&q=product+manager&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=product+manager&htidocid=xaxr6amMZroAAAAAAAAAAA%3D%3D","job_offer_expiration_datetime_utc":null,"job_offer_expiration_timestamp":null,"job_required_experience":{"no_experience_required":false,"required_experience_in_months":24,"experience_mentioned":true,"experience_preferred":false},"job_required_skills":null,"job_required_education":{"postgraduate_degree":false,"professional_certification":false,"high_school":false,"associates_degree":false,"bachelors_degree":false,"degree_mentioned":false,"degree_preferred":false,"professional_certification_mentioned":false},"job_experience_in_place_of_education":false,"job_min_salary":null,"job_max_salary":null,"job_salary_currency":null,"job_salary_period":null,"job_highlights":{"Qualifications":["Minimum of 2 years’ experience with content management or digital asset management solutions","Experience with content creation workflows","Knowledge of the tools and processes development teams use to develop, build, and test integrations","Minimum of 2 years product management experience or product owner in an agile development environment; strong preference for experience with clients in a SaaS environment","Proven ability to develop product ideas based on multiple quantitative and qualitative inputs and make decisions that solve user needs after consuming and analyzing the input from various sources","Excellent analytical skills with demonstrated experience turning data into actionable insights","Demonstrated ability to effectively collaborate across stakeholders both technical and non-technical","Terrific organizational, problem-solving and time management skills","Ability to thrive in a dynamic, fast-paced software development environment","Excellent verbal and written communication skills"],"Responsibilities":["The successful Product Manager will be a key member of the platform product management team and will work closely with the technology, design, editorial teams to evaluate and deliver content management solutions; developing a deep understanding of internal user needs, communicating product definition and prioritization, analyzing technology solutions, process improvements, working closely with engineering teams to deliver features, and acting upon user feedback to continuously improve the product","Drive product design end-to-end, working with the product management, design, and development teams, as well as subject matter experts","This will include researching internal user needs, gathering requirements, scoping, and designing creative solutions, articulating, and prioritizing detailed feature definitions and analyzing commercial solutions as necessary","Craft our integration strategy & vision, engaging with other functional teams to understand and redefine workflows","Collaborate with fellow product managers to ensure a cohesive product vision and roadmap","Effectively present product plans, ideas, and designs to technical and non-technical stakeholders for feedback","Collaborate with UX team to define new user interfaces and process flows","Own prioritization of the product backlog, including translation of roadmap features into features, epics/user stories, preparing for the release or program increment (PI) planning","Work with assigned engineering scrum teams to plan workflow, define user stories and acceptance criteria, and review test plans","Monitor product usage and interact regularly with support teams and educators to analyze product feedback and build product knowledge","Stay abreast of trends, key issues, competitors, and partner offerings"],"Benefits":["Pay Range – This role’s range is $60,750 - $99,750","The wage range for this role takes into account the wide range of factors that Curriculum Associates considers in making compensation decisions based on our Compensation Philosophy","Actual base pay within that range will vary based upon several factors including, but not limited to, prior experience and relevant skill sets","At Curriculum Associates, it is not typical for an individual to be hired at or near the top of the range for their role and compensation decisions are dependent on the facts and circumstances for each case","This role is also eligible to participate in the company bonus plan","Benefits – Benefit eligible employees (and their families) are covered by medical, dental, vision, and basic life insurance","Employees can enroll in our company’s 401k plan and receive an employer match","Employees have access to a flexible vacation and sick policy in addition to twelve paid holidays and a winter office closure between Christmas and New Year's, as well as a number of additional perks and benefits"]},"job_job_title":"Product manager","job_posting_language":"en","job_onet_soc":"11202100","job_onet_job_zone":"4"},{"employer_name":"Insight Global","employer_logo":"https://images.squarespace-cdn.com/content/5f7f984c3ca20d1d55b276f7/1619793549819-L54X3W9Z5RD277UPNH9S/IGLogoPublic.png?content-type=image%2Fpng","employer_website":"http://www.insightglobal.com","employer_company_type":"Staffing","job_publisher":"LinkedIn","job_id":"2YCHTMigqogAAAAAAAAAAA==","job_employment_type":"CONTRACTOR","job_title":"Product Manager","job_apply_link":"https://www.linkedin.com/jobs/view/product-manager-at-insight-global-3578266421","job_apply_is_direct":false,"job_apply_quality_score":0.5532,"job_description":"Must-haves\n• 4+ years of product management & ownership experience within a digital, entertainment or software industry\n• Ability to Maintain and prioritize the product backlog- Writing user stores, ensure that the user value, context, and acceptance criteria are clear and testable\n• Experience within a SAFe Scrum environment- Participate in all key ceremonies and standups (refinement, planning, retro and review) Set sprint goals for the team, work with stakeholders to ensure team alignment and provide feedback to the team\n• Familiarity with Roku, SmartTV & streaming Applications across mobile development\n\nDay-to-Day\n\nInsight Global is searching for a Product Owner to join the team at one of our largest Entertainment companies in New York City. This person will be responsible for designing, defining, and building consumer-facing streaming applications for mobile- Roku, SmartTV & streaming Applications. Works closely with the OTT development team to ensure that they understand the requirements and goals of the project. Makes decisions including feature builds, ricks to take and align decisions with product vision and strategy. Manages and prioritized the backlog of story creation, ensure user value and context as well as acceptance criteria is clear. Manage Sprint Activities including scrum ceremonies and standups. They will need to Collaborate with the business and tech development teams to define product vision, roadmap, and growth opportunities. Work with the project management team to assess value, develop cases, and prioritize stories, and epics to ensure work focuses on those with maximum value and are aligned with product/marketing strategy.","job_is_remote":true,"job_posted_at_timestamp":1682020178,"job_posted_at_datetime_utc":"2023-04-20T19:49:38.000Z","job_city":null,"job_state":null,"job_country":"US","job_latitude":37.09024,"job_longitude":-95.71289,"job_benefits":null,"job_google_link":"https://www.google.com/search?gl=us&hl=en&rciv=jb&q=product+manager&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=product+manager&htidocid=2YCHTMigqogAAAAAAAAAAA%3D%3D","job_offer_expiration_datetime_utc":"2023-05-20T19:49:38.000Z","job_offer_expiration_timestamp":1684612178,"job_required_experience":{"no_experience_required":false,"required_experience_in_months":48,"experience_mentioned":true,"experience_preferred":false},"job_required_skills":null,"job_required_education":{"postgraduate_degree":false,"professional_certification":false,"high_school":false,"associates_degree":false,"bachelors_degree":true,"degree_mentioned":false,"degree_preferred":false,"professional_certification_mentioned":false},"job_experience_in_place_of_education":false,"job_min_salary":55,"job_max_salary":85,"job_salary_currency":"USD","job_salary_period":"HOUR","job_highlights":{"Qualifications":["4+ years of product management & ownership experience within a digital, entertainment or software industry","Ability to Maintain and prioritize the product backlog- Writing user stores, ensure that the user value, context, and acceptance criteria are clear and testable","Familiarity with Roku, SmartTV & streaming Applications across mobile development"],"Responsibilities":["This person will be responsible for designing, defining, and building consumer-facing streaming applications for mobile- Roku, SmartTV & streaming Applications","Works closely with the OTT development team to ensure that they understand the requirements and goals of the project","Makes decisions including feature builds, ricks to take and align decisions with product vision and strategy","Manages and prioritized the backlog of story creation, ensure user value and context as well as acceptance criteria is clear","Manage Sprint Activities including scrum ceremonies and standups","They will need to Collaborate with the business and tech development teams to define product vision, roadmap, and growth opportunities","Work with the project management team to assess value, develop cases, and prioritize stories, and epics to ensure work focuses on those with maximum value and are aligned with product/marketing strategy"]},"job_job_title":"Product manager","job_posting_language":"en","job_onet_soc":"11202100","job_onet_job_zone":"4"},{"employer_name":"Snap Inc.","employer_logo":"https://res.cloudinary.com/crunchbase-production/image/upload/c_lpad,h_170,w_170,f_auto,b_white,q_auto:eco,dpr_1/v1501594423/jjngdeqnwexiaebwnmvx.png","employer_website":"http://www.snap.com","employer_company_type":"Information","job_publisher":"Wd1.Myworkdaysite.com","job_id":"evaEaivilP4AAAAAAAAAAA==","job_employment_type":"FULLTIME","job_title":"Group Product Manager, Brand Ads","job_apply_link":"https://wd1.myworkdaysite.com/recruiting/snapchat/snap/job/Seattle-Washington/Group-Product-Manager--Brand-Ads_R0031149","job_apply_is_direct":false,"job_apply_quality_score":0.7112,"job_description":"Snap Inc. is a camera company. We believe that reinventing the camera represents our greatest opportunity to improve the way people live and communicate. Our products empower people to express themselves, live in the moment, learn about the world, and have fun together. The Ads Product team uses creativity, research, insights, and operational excellence to steer our product vision across Snap Inc. This team of Designers, Scientists, and Product Managers works in a highly collaborative environment to build the products and experiences that innovate and improve the performance of Snap's advertising platform to drive value and success to our customers. We are seeking an experienced Group PM, Brand Advertising to support our teams solving interesting technical challenges, building world-class experiences in Snapchat and maintaining software and a platform used by millions every day. What you'll do: Be the single threaded leader for Brand advertisers, one of our largest and most important customer verticals, and own the objectives and roadmap Work with your team and partner teams to deliver products, features, and improvements that deliver great value to our customers and users Drive full-cycle product development with a team of cross-functional groups across Product, Data Science, Engineering, and Design Leverage critical thinking, emerging trends and market analysis to set product strategy and define product roadmap Define and analyze core success metrics as the product evolves Critically think about how teams collaborate to achieve product goals and lead efforts to improve cross-functional collaboration Knowledge, Skills & Abilities: An inspiring cross functional leader with deep product management experience A team player who can collaborate and drive alignment across the organization from C-Levels through to engineers, designers, other product teams, and cross-functional teams An effective mentor to direct report and cross functional teams Ability to execute against defined objectives both tactically and strategically Ability to initiate and drive emerging projects from strategy to completion Ability to communicate results clearly and effectively across a matrix organization A seasoned strategic leader and product-minded thinker Minimum Qualifications: Bachelor’s degree or equivalent relevant years of experience 10+ years of product management experience at a technology company Preferred Qualifications: Master’s or PhD degree other advanced academic work in a relevant field Experience in a technical product management role Experience performing product-oriented quantitative analysis Experience leading product management teams from strategy to launch Experience working with maps or location-based data services Compensation: In the United States, work locations are assigned a pay zone which determines the salary range for the position. The successful candidate’s starting pay will be determined based on job-related skills, experience, qualifications, work location, and market conditions. These pay zones may be modified in the future. Zone A (CA, WA, NYC): The base salary range for this position is $265,000 - $385,000 annually Zone B: The base salary range for this position is $252,000 - $366,000 annually Zone C: The base salary range for this position is $225,000 - $327,000 annually This position is eligible for equity in the form of RSUs \"Default Together\" Policy at Snap: At Snap Inc. we believe that being together in person helps us build our culture faster, reinforce our values, and serve our community, customers and partners better through dynamic collaboration. To reflect this, we practice a “default together” approach and expect our team members to work in an office at least 80% of the time (an average of 4 days per week). If you are not based in the same location(s) listed for this role and are open to relocation, we encourage you to apply to take advantage of our generous relocation policy. At Snap, we believe that having a team of diverse backgrounds and voices working together will enable us to create innovative products that improve the way people live and communicate. Snap is proud to be an equal opportunity employer, and committed to providing employment opportunities regardless of race, religious creed, color, national origin, ancestry, physical disability, mental disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, pregnancy, childbirth and breastfeeding, age, sexual orientation, military or veteran status, or any other protected classification, in accordance with applicable federal, state, and local laws. EOE, including disability/vets. If you have a disability or special need that requires accommodation, please don’t be shy and contact us at accommodations-ext@snap.com. Our Benefits: Snap Inc. is its own community, so we’ve got your back! We do our best to make sure you and your loved ones have everything you need to be happy and healthy, on your own terms. Our benefits are built around your needs and include paid maternity & paternity leave, comprehensive medical coverage, emotional and mental health support programs, and compensation packages that let you share in Snap’s long-term success! A Decade of Snap: Learn about our origin story, values, mission, culture of innovation, and more. CitizenSnap: In our third annual CitizenSnap Report, we demonstrate progress towards our environmental, social, and governance (ESG) goals, and we lay out our plans looking forward. The DEI Innovation Summit: Watch highlights from the 2nd annual DEI Innovation Summit, which brings together thought leaders and DEI experts for a day of courageous conversations to enable bold action. Snap News: Stay up to date on the latest and greatest product and innovation news at Snap Applicant and Candidate Privacy Policy","job_is_remote":true,"job_posted_at_timestamp":1681948800,"job_posted_at_datetime_utc":"2023-04-20T00:00:00.000Z","job_city":null,"job_state":null,"job_country":"US","job_latitude":37.09024,"job_longitude":-95.71289,"job_benefits":["health_insurance"],"job_google_link":"https://www.google.com/search?gl=us&hl=en&rciv=jb&q=product+manager&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=product+manager&htidocid=evaEaivilP4AAAAAAAAAAA%3D%3D","job_offer_expiration_datetime_utc":null,"job_offer_expiration_timestamp":null,"job_required_experience":{"no_experience_required":false,"required_experience_in_months":120,"experience_mentioned":true,"experience_preferred":true},"job_required_skills":null,"job_required_education":{"postgraduate_degree":false,"professional_certification":false,"high_school":false,"associates_degree":false,"bachelors_degree":false,"degree_mentioned":true,"degree_preferred":false,"professional_certification_mentioned":false},"job_experience_in_place_of_education":false,"job_min_salary":null,"job_max_salary":null,"job_salary_currency":null,"job_salary_period":null,"job_highlights":{},"job_job_title":"Product manager","job_posting_language":"en","job_onet_soc":"11201100","job_onet_job_zone":"4"},{"employer_name":"Ancestry","employer_logo":"https://cmsasset.ancestrycdn.com/content/dam/ancestry-corp/resources/logos-library/ancestry-logo.png","employer_website":"http://www.ancestry.com","employer_company_type":"Information","job_publisher":"Ancestry Careers","job_id":"JIuJynUbDb8AAAAAAAAAAA==","job_employment_type":"FULLTIME","job_title":"Staff Product Manager - International","job_apply_link":"https://careers.ancestry.com/jobs/e9ff65b8-0737-4fff-ad03-688641d65f98","job_apply_is_direct":false,"job_apply_quality_score":0.9388,"job_description":"About Ancestry:\nWhen you join Ancestry, you join a human-centered company where every person’s story is important. We believe that by discovering the struggles and triumphs of our past, we can foster deeper bonds and more meaningful connections among families and communities. With more than 30+ billion digitized global historical records, 125+ million family trees, and 22+ million people in our growing AncestryDNA database, Ancestry helps customers discover their family story and gain a new level of understanding about their lives.\n\nWe are committed to our location flexible work approach, allowing you to work from where you want — in an office or from home or a hybrid of both (subject to location restrictions and roles that are required to be in the office). We will continue to hire and promote beyond the boundaries of our office locations, to enable broadened possibilities for employee diversity.\n\nTogether, we work every day to foster a work environment that's inclusive as well as diverse, and where our people can be themselves. Every idea and perspective is valued so that our products and services reflect the global and diverse clients we serve.\n\nAncestry encourages applications from minorities, women, the disabled, protected veterans and all other qualified applicants. Passionate about dedicating your work to enriching people’s lives? Join the curious.\n\nAncestry is looking for a Product Manager to lead our international product strategy, roadmap and execution as Ancestry expands to dozens of new markets across the globe. You will report to the Director of Technical Product Manager and join a team of designers, engineers, data scientists, and localization experts to push the boundaries for our international experiences. You will have the creativity to look at problems in new ways and to try new things, a hypothesis-driven mentality, a balance of creativity and organizational influence.\n\nWhat you will do:\n• Partner with product, marketing and business development teams to create international strategy and align with partners.\n• You will tackle challenging, complex problems that play a central role in how customers search and discover content to create an industry-leading research experience.\n• In partnership with your colleagues, you'll transform your strategy into a product that scales globally. You will consider local customer needs, cultural nuance, and a variety of environments to help our business grow and retain our loyal customer base while also addressing the needs of our new customers.\n• Define product success criteria, develop roadmap and implement towards increased growth.\n• Collaboratively partner with research user experience, marketing, customer support, and legal teams to deliver customer value on a rapid and regular schedule; adapt from quantitative and qualitative feedback; iterate approach with urgency based on insights.\n• Delve into product performance and customer trends with data science, product analytics and customer research to gain insight into your customers and to promote next-generation search experiences.\n\nWho you are:\n• 7+ years of experience delivering consumer products. Experience developing and localizing global products.\n• You have experience building data-driven products at scale (serving millions of customers) through partnerships with engineering.\n• Passionate, creative customer thinker using a combination of data and customer insights, while achieving results. You are known for delivering elegant solutions for true user problems.\n• Work well with individuals at all levels and across departments.\n• Experience with presentation techniques, meeting management, and team building skills.\n• A high bar across the board - for your own contributions, for the people you work with, and for the products you work on. You are data-driven to the point of pulling the data you need to inform your decisions. Experience working with experimentation to assess the effectiveness of feature and algorithmic updates coupled with great design instincts.\n• Explain a vision and empower others across leadership and partners.\n• Last but not least, you excel in a collaborative environment and define personal success by the efficacy of your team, the regard of your colleagues, and the delight of our customers.\n• Bachelor's degree; STEM / computer science background.\n\nAdditional Information:\n\nAncestry is an Equal Opportunity Employer that makes employment decisions without regard to race, color, religious creed, national origin, ancestry, sex, pregnancy, sexual orientation, gender, gender identity, gender expression, age, mental or physical disability, medical condition, military or veteran status, citizenship, marital status, genetic information, or any other characteristic protected by applicable law. In addition, Ancestry will provide reasonable accommodations for qualified individuals with disabilities.\n\nAll job offers are contingent on a background check screen that complies with applicable law. For San Francisco office candidates, pursuant to the San Francisco Fair Chance Ordinance, Ancestry will consider for employment qualified applicants with arrest and conviction records.\n\nAncestry is not accepting unsolicited assistance from search firms for this employment opportunity. All resumes submitted by search firms to any employee at Ancestry via-email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Ancestry. No fee will be paid in the event the candidate is hired by Ancestry as a result of the referral or through other means.","job_is_remote":false,"job_posted_at_timestamp":1681751474,"job_posted_at_datetime_utc":"2023-04-17T17:11:14.000Z","job_city":null,"job_state":null,"job_country":"US","job_latitude":37.09024,"job_longitude":-95.71289,"job_benefits":null,"job_google_link":"https://www.google.com/search?gl=us&hl=en&rciv=jb&q=product+manager&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=product+manager&htidocid=JIuJynUbDb8AAAAAAAAAAA%3D%3D","job_offer_expiration_datetime_utc":"2023-07-18T15:43:49.000Z","job_offer_expiration_timestamp":1689695029,"job_required_experience":{"no_experience_required":false,"required_experience_in_months":84,"experience_mentioned":true,"experience_preferred":false},"job_required_skills":null,"job_required_education":{"postgraduate_degree":false,"professional_certification":false,"high_school":false,"associates_degree":false,"bachelors_degree":false,"degree_mentioned":true,"degree_preferred":false,"professional_certification_mentioned":false},"job_experience_in_place_of_education":false,"job_min_salary":null,"job_max_salary":null,"job_salary_currency":null,"job_salary_period":null,"job_highlights":{"Qualifications":["7+ years of experience delivering consumer products","Experience developing and localizing global products","You have experience building data-driven products at scale (serving millions of customers) through partnerships with engineering","You are known for delivering elegant solutions for true user problems","Experience working with experimentation to assess the effectiveness of feature and algorithmic updates coupled with great design instincts","Bachelor's degree; STEM / computer science background"],"Responsibilities":["You will report to the Director of Technical Product Manager and join a team of designers, engineers, data scientists, and localization experts to push the boundaries for our international experiences","You will have the creativity to look at problems in new ways and to try new things, a hypothesis-driven mentality, a balance of creativity and organizational influence","Partner with product, marketing and business development teams to create international strategy and align with partners","You will tackle challenging, complex problems that play a central role in how customers search and discover content to create an industry-leading research experience","In partnership with your colleagues, you'll transform your strategy into a product that scales globally","You will consider local customer needs, cultural nuance, and a variety of environments to help our business grow and retain our loyal customer base while also addressing the needs of our new customers","Define product success criteria, develop roadmap and implement towards increased growth","Collaboratively partner with research user experience, marketing, customer support, and legal teams to deliver customer value on a rapid and regular schedule; adapt from quantitative and qualitative feedback; iterate approach with urgency based on insights","Delve into product performance and customer trends with data science, product analytics and customer research to gain insight into your customers and to promote next-generation search experiences","Work well with individuals at all levels and across departments","A high bar across the board - for your own contributions, for the people you work with, and for the products you work on","Explain a vision and empower others across leadership and partners","Last but not least, you excel in a collaborative environment and define personal success by the efficacy of your team, the regard of your colleagues, and the delight of our customers"]},"job_job_title":"Product manager","job_posting_language":"en","job_onet_soc":"11202100","job_onet_job_zone":"4"},{"employer_name":"Cardinal Health","employer_logo":"https://www.cardinalhealth.com/content/dam/corp/web/logos/logo-main.png","employer_website":"http://www.cardinal.com","employer_company_type":"Wholesale","job_publisher":"Cardinal Health Careers","job_id":"2ZETfSIbVAcAAAAAAAAAAA==","job_employment_type":"FULLTIME","job_title":"Product Manager, Delivery Consolidation","job_apply_link":"https://jobs.cardinalhealth.com/search/jobdetails/product-manager-delivery-consolidation/8d17f758-31b2-4805-9a56-51e8f0ad7831","job_apply_is_direct":false,"job_apply_quality_score":0.7968,"job_description":"What Logistics contributes to Cardinal Health\n\nThe Cardinal Health Logistics team delivers products and services that create a differentiated experience for customers while relentlessly improving speed, reliability, and cost through supply chain optimization. We enable growth through effective and efficient movement of over 45 million shipments for Cardinal Health customers. This includes the flow of materials and products between suppliers, manufacturers, and customers.\n\nAs a product manager for our delivery consolidation, you will play a key role in helping our logistics team achieve our vision of reducing freight touches, improving customer delivery time, and build the vision for future consolidation models. More importantly, you will be at the center of Cardinal Health’s promise to our customers to be healthcare’s most trusted partner. Your work will drive cost improvement by uncovering and identifying network optimization opportunities to reduce overall transportation cost.\n\nResponsibilities\n• Create and execute a multi-year strategy and long-term vision for your product\n• Create and maintain a product roadmap, project plan and formal business proposals to secure support from stakeholders and senior leadership\n• Partner with leadership and one or more delivery teams to execute your strategy and achieve your vision\n• Identify, document, and validate customer and business requirements and communicate those to one or more delivery teams – concept through launch and new features and capabilities\n• Champion the voice of customer across stakeholder groups; focus on delivering value that creates a sustainable competitive advantage\n• Lead cross-functional implementation teams to identify target customers, commercialize the product, and launch across the network\n• Maintain alignment across technology, finance, and business teams\n• Advance product while iterating rapidly; create and measure to KPIs and leverage data insights to adjust roadmap\n• Provide quantitative and qualitative analysis to support product objectives\n• Collaborate across functions and internal business units, working with peers and leadership to drive success for your product\n• Use change management techniques to drive adoption of your product\n• Create and maintain financial statements, product vision, strategy, reports, metrics, and implementation plans\n\nQualifications\n• Bachelor’s Degree in related field or equivalent work experience, preferred\n• MBA is a plus\n• 6+ years’ experience as a Product Manager within Logistics/Transportation, Supply Chain, Economics, Project Management, or Engineering preferred\n• Prior fiscal responsibilities preferred\n• Professional level business writing skills: a writing sample will be required as part of the interview process\n\nWhat is expected of you and others at this level\n• Applies advanced knowledge and understanding of concepts, principles, and technical capabilities to manage a wide variety of projects\n• Participates in the development of policies and procedures to achieve specific goals\n• Recommends new practices, processes, metrics, or models\n• Works on or may lead complex projects of large scope\n• Projects may have significant and long-term impact\n• Provides solutions which may set precedent\n• Independently determines method for completion of new projects\n• Receives guidance on overall project objectives\n• Acts as a mentor to less experienced colleagues\n\nAnticipated salary range: $97,700 – $139,600\n\nBonus eligible: Yes\n\nBenefits: Health insurance, 401k Contributions, Paid Time Off, Vacation, STD/LTD\n\n#LI-Remot\n\nCardinal Health supports an inclusive workplace that values diversity of thought, experience and background. We celebrate the power of our differences to create better solutions for our customers by ensuring employees can be their authentic selves each day. Cardinal Health is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, ancestry, age, physical or mental disability, sex, sexual orientation, gender identity/expression, pregnancy, veteran status, marital status, creed, status with regard to public assistance, genetic status or any other status protected by federal, state or local law.","job_is_remote":false,"job_posted_at_timestamp":1681862400,"job_posted_at_datetime_utc":"2023-04-19T00:00:00.000Z","job_city":null,"job_state":null,"job_country":"US","job_latitude":37.09024,"job_longitude":-95.71289,"job_benefits":["retirement_savings","health_insurance","paid_time_off","dental_coverage"],"job_google_link":"https://www.google.com/search?gl=us&hl=en&rciv=jb&q=product+manager&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=product+manager&htidocid=2ZETfSIbVAcAAAAAAAAAAA%3D%3D","job_offer_expiration_datetime_utc":null,"job_offer_expiration_timestamp":null,"job_required_experience":{"no_experience_required":false,"required_experience_in_months":72,"experience_mentioned":true,"experience_preferred":true},"job_required_skills":null,"job_required_education":{"postgraduate_degree":false,"professional_certification":false,"high_school":false,"associates_degree":false,"bachelors_degree":false,"degree_mentioned":true,"degree_preferred":true,"professional_certification_mentioned":false},"job_experience_in_place_of_education":false,"job_min_salary":null,"job_max_salary":null,"job_salary_currency":null,"job_salary_period":null,"job_highlights":{"Qualifications":["Professional level business writing skills: a writing sample will be required as part of the interview process"],"Responsibilities":["As a product manager for our delivery consolidation, you will play a key role in helping our logistics team achieve our vision of reducing freight touches, improving customer delivery time, and build the vision for future consolidation models","More importantly, you will be at the center of Cardinal Health’s promise to our customers to be healthcare’s most trusted partner","Your work will drive cost improvement by uncovering and identifying network optimization opportunities to reduce overall transportation cost","Create and execute a multi-year strategy and long-term vision for your product","Create and maintain a product roadmap, project plan and formal business proposals to secure support from stakeholders and senior leadership","Partner with leadership and one or more delivery teams to execute your strategy and achieve your vision","Identify, document, and validate customer and business requirements and communicate those to one or more delivery teams – concept through launch and new features and capabilities","Champion the voice of customer across stakeholder groups; focus on delivering value that creates a sustainable competitive advantage","Lead cross-functional implementation teams to identify target customers, commercialize the product, and launch across the network","Maintain alignment across technology, finance, and business teams","Advance product while iterating rapidly; create and measure to KPIs and leverage data insights to adjust roadmap","Provide quantitative and qualitative analysis to support product objectives","Collaborate across functions and internal business units, working with peers and leadership to drive success for your product","Use change management techniques to drive adoption of your product","Create and maintain financial statements, product vision, strategy, reports, metrics, and implementation plans","Applies advanced knowledge and understanding of concepts, principles, and technical capabilities to manage a wide variety of projects","Participates in the development of policies and procedures to achieve specific goals","Recommends new practices, processes, metrics, or models","Projects may have significant and long-term impact","Provides solutions which may set precedent","Independently determines method for completion of new projects","Receives guidance on overall project objectives","Acts as a mentor to less experienced colleagues"],"Benefits":["Anticipated salary range: $97,700 – $139,600","Bonus eligible: Yes","Benefits: Health insurance, 401k Contributions, Paid Time Off, Vacation, STD/LTD"]},"job_job_title":"Product manager","job_posting_language":"en","job_onet_soc":"11202100","job_onet_job_zone":"4"},{"employer_name":"NetApp, Inc.","employer_logo":"https://www.netapp.com/media/na_logo_black_rgb_reg-mark_tcm19-21014.jpg","employer_website":"http://www.netapp.com","employer_company_type":"Manufacturing","job_publisher":"Jobs At NetApp","job_id":"1HMlivO9mqQAAAAAAAAAAA==","job_employment_type":"FULLTIME","job_title":"Sr. Manager, Operations Product Management","job_apply_link":"https://jobs.netapp.com/job/Sr_-Manager,-Operations-Product-Management/1017213600/","job_apply_is_direct":false,"job_apply_quality_score":0.7968,"job_description":"Job Summary\n\nSr Manager Operations Product Management\n\nAbout NetApp\n\nWe are forward-thinking technology people with heart. We make our own rules, drive our own opportunities, and try to approach every challenge with fresh eyes. Of course, we cannot do it alone. We know when to ask for help, collaborate with others, and partner with smart people. We embrace diversity and openness because it’s in our DNA. We push limits and reward great ideas. What is your great idea?\n\nJob Summary\n\nLead a team of seasoned Operations Product Managers responsible for driving the successful release of product from development through launch, and drive for continuous improvement and agility in the sustaining process ensuring that program timelines are met or accelerated. As an Sr Manager of Operations Product Management, you must be self initiator, natural team leader with excellent communication/collaboration skills to influence cross functional teams, be responsive, flexible and able to succeed within a collaborative team environment managing competing work prioritities, multiple work streams, identifying risk, implementing action plans to enable successful execution of the business strategy.\n\nThe Sr. Manager of Operations Product Management must possess a deep knowledge of hardware architecture, strong understanding of technology trends/sweets spots, design for simplicity, manufacturing and supply chain, product structure and product support complexity, as you will work closely with operations, supply chain, engineering, and other business teams to implement, adapt, and maintain systems which facilitate the management of the entire product lifecycle.\n\nA successful Sr Manager of Operations Product Management is expected to drive Engineering and Product Management to optimize the product design and architecture for cost, testability, manufacturability, and quality while ensuring that the BOM is supply chain friendly through the selection of components that are dual sourced and are produced in high volume. He/She is dynamic, results driven, organized and detail oriented; excels in program management; proficient in analyzing/using business data and developing business strategy as well as managing tactical tasks, strong team player who can communicate with ease at all levels; thrives in an ambiguous environment and is adept at facilitating actions and resolving conflicts.\n\nFurthermore, this team leader within Operations is the primary operations interface to the core product and development teams, Product Life Cycle Management processes and other functional organizations within NetApp. Overall mission is a successful product launch defined by meeting stated schedule, availability, and customer experience goals.\n\nJob Requirements\n\nJob Requirements\n\n• Lead Operations product management team that is responsible for all aspects of NPI and sustaining portfolio management with the cross functional team to execute a product launch; manage project schedules, identify risks and clearly communicate goals to project stakeholders.\n\n• Participate in early-stage product development discussions with engineering, product management and communicate expectations and ensure the Manufacturing, Supply Chain, Quality, Test, & Service requirements and alignment with the current operational objectives of fulfillment, cost savings and manufacturability.\n\n• Drive Engineering and Product Management to optimize the product design and architecture for cost, testability, manufacturability, and quality while ensuring that the selection of components that are dual sourced and are produced in high volume.\n\n• Set initial build plans, drive material readiness with supply chain and evaluate constraints.\n\n• Drive the optimization of sustaining product and provide a feedback loop to Engineering, Product management and Supply Chain to capture lessons learned from product rollouts and provide recommendations for future designs and processes.\n\n• Demonstrate the ability to:\n\no Effectively evaluate performance against customer and business requirements\n\no Define and implement risk mitigation.\n\no Drive continuous improvement objectives against program issues with management and coordinate resources and implementation with other teams.\n\n• Partner with operations strategic sourcing team to drive cost reduction and component sourcing strategies throughout the product lifecycle.\n\n• Actively participates in Hardware Engineering design discussions to provide input on DFx (manufacturing, quality, sourcing, service and cost) methods to be incorporated into new product designs.\n\n• Use your technical expertise to drive engineering and the supply chain team to meet program cost targets at a product and commodity level for your project.\n\n• Develop and maintain PLM processes and policies for effective product transition management; incorporate BOM risk analysis, supply continuity, and E&O risk concepts into the product roadmap plan for NPI and transition of sustaining products to end of life.\n\n• Establish clear mechanisms to communicate program status and change with program team and other staff. Must be able to effectively communicate risk and status clearly and succinctly to management, calling out key issues and presenting options for resolution to the cross-functional executive team through new product reviews and other executive forums.\n\n• Excellent understanding of financial principals, including analysis of P&L and ROI data.\n\n• Excellent understanding of market, field sales, customer, product roadmap and product positioning.\n\n• Excellent understanding of Six sigma, continuous process improvement concepts\n\n• Strong analytics skills using BI tools such as Tableau/PowerBi and ability to deliver business insights for key stakeholders\n\nEducation\n\nExperience Desired\n\n• Experience with electronics, electro mechanical design and knowledge in manufacturing processes.\n\n• Demonstrated team leadership, program management and/or product lifecycle management experience.\n\n• Extensive cross-functional technical knowledge and demonstrates working knowledge of Product Lifecycle Management and Program Mgmt/Business principles, recognized expert in their field.\n\n• A solid foundation in hard enterprise and cloud architectures, and solution strategy is highly desired.\n\nEducation\n\nTypically requires a minimum of 15 years of related experience with a bachelor’s degree in an Electrical Engineering, Computer HW Engineering discipline or 12 years and a Master's degree or A PhD with 10 years’ experience or equivalent experience.\n\nWhy NetApp?\n\nIn a world full of generalists, NetApp is a specialist. No one knows how to elevate the world’s biggest clouds like NetApp. We are data-driven and empowered to innovate. Trust, integrity, and teamwork all combine to make a difference for our customers, partners, and communities.\n\nWe expect a healthy work-life balance. Our volunteer time off program is best in class, offering employees 40 hours of paid time off per year to volunteer with their favorite organizations. We provide comprehensive medical, dental, wellness, and vision plans for you and your family. We offer educational assistance, legal services, and access to discounts. We also offer financial savings programs to help you plan for your future.\n\nIf you run toward knowledge and problem-solving, join us.","job_is_remote":false,"job_posted_at_timestamp":1681689600,"job_posted_at_datetime_utc":"2023-04-17T00:00:00.000Z","job_city":null,"job_state":null,"job_country":"US","job_latitude":37.09024,"job_longitude":-95.71289,"job_benefits":["health_insurance","dental_coverage","paid_time_off"],"job_google_link":"https://www.google.com/search?gl=us&hl=en&rciv=jb&q=product+manager&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=product+manager&htidocid=1HMlivO9mqQAAAAAAAAAAA%3D%3D","job_offer_expiration_datetime_utc":null,"job_offer_expiration_timestamp":null,"job_required_experience":{"no_experience_required":false,"required_experience_in_months":180,"experience_mentioned":true,"experience_preferred":false},"job_required_skills":null,"job_required_education":{"postgraduate_degree":false,"professional_certification":false,"high_school":false,"associates_degree":false,"bachelors_degree":false,"degree_mentioned":true,"degree_preferred":true,"professional_certification_mentioned":false},"job_experience_in_place_of_education":false,"job_min_salary":null,"job_max_salary":null,"job_salary_currency":null,"job_salary_period":null,"job_highlights":{"Qualifications":["Effectively evaluate performance against customer and business requirements","Must be able to effectively communicate risk and status clearly and succinctly to management, calling out key issues and presenting options for resolution to the cross-functional executive team through new product reviews and other executive forums","Excellent understanding of Six sigma, continuous process improvement concepts","Typically requires a minimum of 15 years of related experience with a bachelor’s degree in an Electrical Engineering, Computer HW Engineering discipline or 12 years and a Master's degree or A PhD with 10 years’ experience or equivalent experience"],"Responsibilities":["Lead a team of seasoned Operations Product Managers responsible for driving the successful release of product from development through launch, and drive for continuous improvement and agility in the sustaining process ensuring that program timelines are met or accelerated","Manager of Operations Product Management must possess a deep knowledge of hardware architecture, strong understanding of technology trends/sweets spots, design for simplicity, manufacturing and supply chain, product structure and product support complexity, as you will work closely with operations, supply chain, engineering, and other business teams to implement, adapt, and maintain systems which facilitate the management of the entire product lifecycle","Furthermore, this team leader within Operations is the primary operations interface to the core product and development teams, Product Life Cycle Management processes and other functional organizations within NetApp","Overall mission is a successful product launch defined by meeting stated schedule, availability, and customer experience goals","Participate in early-stage product development discussions with engineering, product management and communicate expectations and ensure the Manufacturing, Supply Chain, Quality, Test, & Service requirements and alignment with the current operational objectives of fulfillment, cost savings and manufacturability","Drive Engineering and Product Management to optimize the product design and architecture for cost, testability, manufacturability, and quality while ensuring that the selection of components that are dual sourced and are produced in high volume","Set initial build plans, drive material readiness with supply chain and evaluate constraints","Define and implement risk mitigation","Partner with operations strategic sourcing team to drive cost reduction and component sourcing strategies throughout the product lifecycle","Actively participates in Hardware Engineering design discussions to provide input on DFx (manufacturing, quality, sourcing, service and cost) methods to be incorporated into new product designs","Use your technical expertise to drive engineering and the supply chain team to meet program cost targets at a product and commodity level for your project","Develop and maintain PLM processes and policies for effective product transition management; incorporate BOM risk analysis, supply continuity, and E&O risk concepts into the product roadmap plan for NPI and transition of sustaining products to end of life","Establish clear mechanisms to communicate program status and change with program team and other staff"],"Benefits":["Our volunteer time off program is best in class, offering employees 40 hours of paid time off per year to volunteer with their favorite organizations","We provide comprehensive medical, dental, wellness, and vision plans for you and your family","We offer educational assistance, legal services, and access to discounts","We also offer financial savings programs to help you plan for your future"]},"job_job_title":"Sr. manager","job_posting_language":"en","job_onet_soc":"11202100","job_onet_job_zone":"4"},{"employer_name":"Logistics Management Institute","employer_logo":"https://upload.wikimedia.org/wikipedia/commons/thumb/1/1b/Logistics_Management_Institute_logo.svg/1200px-Logistics_Management_Institute_logo.svg.png","employer_website":"http://www.lmi.org","employer_company_type":"Consulting","job_publisher":"LMI - ICIMS","job_id":"huPXMA4961UAAAAAAAAAAA==","job_employment_type":"FULLTIME","job_title":"Product Manager","job_apply_link":"https://careers-lmi.icims.com/jobs/9662/product-manager/job","job_apply_is_direct":true,"job_apply_quality_score":0.6846,"job_description":"Overview\n\nLMI is seeking a Product Manager to provide strategic planning and product management leadership for the Agile Release Training supporting the development of the Army Training Information System.\n\nResponsibilities\n• Member of Agile Release Train leadership responsible for developing product vision and roadmap and working with Technical Leadership and product teams to deliver value against defined roadmap.\n• Owns the program-level product vision and roadmap, working with stakeholders to develop epics and features to define team-level product roadmaps and backlogs.\n• Prepares for and participates in Program Increment planning and builds, edits, and maintains the program’s product backlog during program increment execution.\n• Ensures that the Agile Release Train delivers the business value committed to within a Program Increment.\n• Works with product teams to prepare and deliver integrated system demonstrations for Program Leadership at the conclusion of the Program Increment.\n• Works with the Release Train Engineer to maintain proper flow of backlog items to implementation and deployment.\n• Works with UX and Design Leads to ensure consistent and compliant UX/UI standards are implemented across the product.\n• Leads and coaches individual Product Owners from a portfolio of product teams to ensure delivery of business value in line with product vision\n• Works with Technical Leadership and Release Management to ensure continuous integration and continuous delivery (CI/CD) of working software.\n• Represents the customer with the ability to prioritize tradeoffs, clarify requirements, and work to drive features to acceptance throughout the agile software development life cycle.\n• Works directly with internal and external stakeholders, including senior staff and managers, and with focused product development teams to ensure successful translation of requirements into high-quality product deliverables.\n• Manages register of stakeholders, including end users, legacy system business owners, functional representatives/SMEs, and technical partners\n\nPercentage of Travel Required: 15%\n\nQualifications\n\nMinimum Qualifications:\n• 5+ years’ experience in product management, product ownership, system engineering, information technology (IT) management, business analysis, computer science, or other related fields, preferably in large DOD programs.\n• Certified Scaled Agile Framework (SAFe) Product Owner/Product Manager (PO/PM).\n• Industry standard human centered design (HCD) certification.\n• Ability to identify, define, analyze, prioritize, and refine requirements, communicating milestones and visions to the Agile Release Train.\n• Experience developing products at an enterprise scale, with large and complex stakeholder networks and interfaces with external systems.\n• Ability to work with stakeholders to understand complex business requirements and develop a product vision and roadmap to deliver incremental business value.\n• Ability to define and deploy, in coordination with Release Management, minimally viable products (MVPs) and minimally viable capability releases (MVCRs) in line with DODI 5000.87.\n• Experience leading large-scale user experience (UX) research efforts and incorporating UX and HCD principles into product vision, roadmap, and backlog.\n• Experience bringing web application products to production, through continuous delivery, and working with strategic communications and change management personnel to drive adoption.\n• Experience leading and coaching a team of Product Owners across a portfolio of teams to ensure delivery of business value aligned to product vision.\n• Experience creating detailed reports and presentations to senior executives and key stakeholders.\n• Experience developing products in an agile framework and leveraging an agile project management tool.\n• Education/Experience: Minimum 3–10 years of directly related experience with a Bachelors’ Degree in business, computer science, management information systems, engineering, or a related field preferred\n• Clearance: Confidential/NAC (T1)\n\nAdditional Qualifications Preferred:\n• Experience with and/or strong understanding of Army enterprise training systems.\n• Experience with and/or strong understanding of Army cloud and software development ecosystem.\n• Experience developing products using SAFe and incorporating various agile frameworks into SAFe (e.g., scrum, Kanban, LeanXP, etc.).\n• Experience with agile project management and development in GitLab.","job_is_remote":false,"job_posted_at_timestamp":1681714800,"job_posted_at_datetime_utc":"2023-04-17T07:00:00.000Z","job_city":null,"job_state":null,"job_country":"US","job_latitude":37.09024,"job_longitude":-95.71289,"job_benefits":null,"job_google_link":"https://www.google.com/search?gl=us&hl=en&rciv=jb&q=product+manager&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=product+manager&htidocid=huPXMA4961UAAAAAAAAAAA%3D%3D","job_offer_expiration_datetime_utc":"2024-04-17T07:00:00.000Z","job_offer_expiration_timestamp":1713337200,"job_required_experience":{"no_experience_required":false,"required_experience_in_months":null,"experience_mentioned":true,"experience_preferred":false},"job_required_skills":null,"job_required_education":{"postgraduate_degree":false,"professional_certification":false,"high_school":false,"associates_degree":false,"bachelors_degree":false,"degree_mentioned":true,"degree_preferred":true,"professional_certification_mentioned":true},"job_experience_in_place_of_education":false,"job_min_salary":null,"job_max_salary":null,"job_salary_currency":null,"job_salary_period":null,"job_highlights":{"Qualifications":["5+ years’ experience in product management, product ownership, system engineering, information technology (IT) management, business analysis, computer science, or other related fields, preferably in large DOD programs","Certified Scaled Agile Framework (SAFe) Product Owner/Product Manager (PO/PM)","Industry standard human centered design (HCD) certification","Ability to identify, define, analyze, prioritize, and refine requirements, communicating milestones and visions to the Agile Release Train","Experience developing products at an enterprise scale, with large and complex stakeholder networks and interfaces with external systems","Ability to work with stakeholders to understand complex business requirements and develop a product vision and roadmap to deliver incremental business value","Ability to define and deploy, in coordination with Release Management, minimally viable products (MVPs) and minimally viable capability releases (MVCRs) in line with DODI 5000.87","Experience leading large-scale user experience (UX) research efforts and incorporating UX and HCD principles into product vision, roadmap, and backlog","Experience bringing web application products to production, through continuous delivery, and working with strategic communications and change management personnel to drive adoption","Experience leading and coaching a team of Product Owners across a portfolio of teams to ensure delivery of business value aligned to product vision","Experience creating detailed reports and presentations to senior executives and key stakeholders","Experience developing products in an agile framework and leveraging an agile project management tool","Clearance: Confidential/NAC (T1)"],"Responsibilities":["LMI is seeking a Product Manager to provide strategic planning and product management leadership for the Agile Release Training supporting the development of the Army Training Information System","Member of Agile Release Train leadership responsible for developing product vision and roadmap and working with Technical Leadership and product teams to deliver value against defined roadmap","Owns the program-level product vision and roadmap, working with stakeholders to develop epics and features to define team-level product roadmaps and backlogs","Prepares for and participates in Program Increment planning and builds, edits, and maintains the program’s product backlog during program increment execution","Ensures that the Agile Release Train delivers the business value committed to within a Program Increment","Works with product teams to prepare and deliver integrated system demonstrations for Program Leadership at the conclusion of the Program Increment","Works with the Release Train Engineer to maintain proper flow of backlog items to implementation and deployment","Works with UX and Design Leads to ensure consistent and compliant UX/UI standards are implemented across the product","Leads and coaches individual Product Owners from a portfolio of product teams to ensure delivery of business value in line with product vision","Works with Technical Leadership and Release Management to ensure continuous integration and continuous delivery (CI/CD) of working software","Represents the customer with the ability to prioritize tradeoffs, clarify requirements, and work to drive features to acceptance throughout the agile software development life cycle","Works directly with internal and external stakeholders, including senior staff and managers, and with focused product development teams to ensure successful translation of requirements into high-quality product deliverables","Manages register of stakeholders, including end users, legacy system business owners, functional representatives/SMEs, and technical partners","Percentage of Travel Required: 15%"]},"job_job_title":"Product manager","job_posting_language":"en","job_onet_soc":"11202100","job_onet_job_zone":"4"}
        ]
    }
